Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: *Bootable Images:* Released BSPs can contain one or more bootable images. Including bootable images allows users to easily try out the BSP using their own hardware.
it_it: *Immagini Avviabili:* I BSP rilasciati possono contenere una o più immagini avviabili [bootable]. L'inclusione di immagini avviabili consente agli utenti di provare facilmente il BSP utilizzando il proprio hardware.

source: *Build Appliance:* Post Hob, the Build Appliance became available. It was never recommended that you use the Build Appliance as a day-to-day production development environment with the Yocto Project. Build Appliance was useful as a way to try out development in the Yocto Project environment.
it_it: *Build Appliance:* Dopo Hob, è diventata disponibile la Build Appliance. Non è mai stato raccomandato di utilizzare la Build Appliance come ambiente di sviluppo di produzione quotidiano con Yocto Project. La Build Appliance era utile per provare lo sviluppo nell'ambiente di Yocto Project.

source: *Build Configuration:* This `video <https://www.youtube.com/watch?v=qYgDZ8YzV6w>`__ overviews and demonstrates build configuration for Toaster.
it_it: *Build Configuration:* Questo `video <https://www.youtube.com/watch?v=qYgDZ8YzV6w>`__ offre una panoramica e una dimostrazione della configurazione della build per Toaster.

source: *Build Custom Layers:* This `video <https://www.youtube.com/watch?v=QJzaE_XjX5c>`__ shows you how to build custom layers that are used with Toaster.
it_it: *Build Custom Layers:* Questo `video <https://www.youtube.com/watch?v=QJzaE_XjX5c>`__ mostra come creare layer personalizzati da utilizzare con Toaster.

source: *Build Dashboard:* This `video <https://www.youtube.com/watch?v=KKqHYcnp2gE>`__ shows you the build dashboard, a page providing an overview of the information available for a selected build.
it_it: *Build Dashboard:* Questo `video <https://www.youtube.com/watch?v=KKqHYcnp2gE>`__ mostra la dashboard di build, una pagina che fornisce una panoramica delle informazioni disponibili per una build selezionata.

source: *Build Output:* Controlled by the :term:`TMPDIR` variable.
it_it: *Output della Build:* Controllata dalla variabile :term:`TMPDIR`.

source: *Build System:* Processes under the control of :term:`BitBake`. This block expands on how BitBake fetches source, applies patches, completes compilation, analyzes output for package generation, creates and tests packages, generates images, and generates cross-development tools.
it_it: *Sistema di Build:* Processi controllati da :term:`BitBake`. Questo blocco illustra in dettaglio come BitBake recupera il codice sorgente, applica le patch, completa la compilazione, analizza l'output per la generazione dei pacchetti, crea e testa i pacchetti, genera le immagini e crea gli strumenti di sviluppo incrociato [cross].

source: *Build the Image:* The OpenEmbedded build system uses the BitBake tool to build images based on the type of image you want to create. You can find more information about BitBake in the :doc:`BitBake User Manual <bitbake:index>`.
it_it: *Build dell'Immagine:* Il sistema di build OpenEmbedded utilizza il tool BitBake per compilare le immagini in base al tipo di immagine che si desidera creare. Ulteriori informazioni su BitBake sono disponibili nel :doc:`Manuale Utente di BitBake <bitbake:index>`.

source: *CROPS:* Used to be a solution available for developing using the Yocto Project on a system not native to Linux (see https://github.com/crops/poky-container).
it_it: *CROPS:* In passato era una soluzione disponibile per lo sviluppo tramite Yocto Project su un sistema non nativo per Linux (https://github.com/crops/poky-container).

source: *Check Out the Proper Branch:* The branch you check out for ``meta-intel`` must match the same branch you are using for the Yocto Project release (e.g. ``blacksail``)::
it_it: *Check Out del Branch Corretto:* Il branch che si sceglie per ``meta-intel`` deve corrispondere al branch utilizzato per la release di Yocto Project (ad esempio, ``blacksail``)::

source: *Check if the fix is already present in the master branch:* This will result in the most straightforward path into the stable branch for the fix.
it_it: *Verificare se la correzione è già presente nel branch master:* Questo consentirà di individuare il path più semplice per l'integrazione della correzione nel branch stabile.

source: *Class Data:* Abstracts common build information (e.g. how to build a Linux kernel).
it_it: *Dati di Classe:* Astraggono le informazioni di build comuni (ad esempio, come compilare un kernel Linux).

source: *Clone the Layer:* ::
it_it: *Clonare il Layer:* ::

source: *Command Lines, BitBake, and Shells:* Traditional development in the Yocto Project involves using the :term:`OpenEmbedded Build System`, which uses BitBake, in a command-line environment from a shell on your development host. You can accomplish this from a host that is a native Linux machine or from a container. Either way, you create, modify, and build images and applications all within a shell-based environment using components and tools available through your Linux distribution and the Yocto Project.
it_it: *Riga di Comando, BitBake e Shell:* Lo sviluppo tradizionale in Yocto Project prevede l'utilizzo del sistema di compilazione [build] :term:`OpenEmbedded Build System`, che si basa su BitBake, in un ambiente a riga di comando da una shell sul sistema host di sviluppo. È possibile farlo da un sistema host nativo Linux o da un container. In entrambi i casi, si creano, modificano e compilano immagini e applicazioni all'interno di un ambiente basato su shell, utilizzando componenti e strumenti disponibili tramite la distribuzione Linux e Yocto Project.

source: *Commit Your Changes:* This is when you can create separate commits. For each commit to create, use the ``git commit -s`` command with the files or directories you want to include in the commit::
it_it: *Commit delle Modifiche:* In questa fase si possono creare commit separati. Per ogni commit da creare, si utilizza il comando ``git commit -s`` specificando i file o le directory da includere nel commit::

source: *Comprehensive Toolchain Capabilities:* Toolchains for supported architectures satisfy most use cases. However, if your hardware supports features that are not part of a standard toolchain, you can easily customize that toolchain through specification of platform-specific tuning parameters. And, should you need to use a third-party toolchain, mechanisms built into the Yocto Project allow for that.
it_it: *Complete Funzionalità della Toolchain:* Le toolchain per le architetture supportate sono sufficienti per la maggior parte dei casi d'uso. Tuttavia, se l'hardware supporta funzionalità non incluse in una toolchain standard, è possibile personalizzarla facilmente specificando parametri di configurazione specifici della piattaforma. Inoltre, qualora fosse necessario utilizzare una toolchain di terze parti, i meccanismi integrati in Yocto Project lo consentono.

source: *Configuration Data:* Defines machine-specific settings, policy decisions, and so forth. Configuration data acts as the glue to bind everything together.
it_it: *Dati di Configurazione:* Definiscono le impostazioni specifiche della macchina, le decisioni relative alle policy e così via. I dati di configurazione fungono da collante per unire tutti gli elementi.

source: *Configuration Files:* Files that hold global definitions of variables, user-defined variables, and hardware configuration information. These files tell the :term:`OpenEmbedded Build System` what to build and what to put into the image to support a particular platform.
it_it: *File di Configurazione:* File che contengono definizioni globali di variabili, variabili definite dall'utente e informazioni sulla configurazione hardware. Questi file indicano al :term:`OpenEmbedded Build System` cosa compilare e cosa includere nell'immagine per supportare una specifica piattaforma.

source: *Configuration:* This `video <https://www.youtube.com/watch?v=UW-j-T2TzIg>`__ provides Toaster build configuration information.
it_it: *Configuration:* Questo `video <https://www.youtube.com/watch?v=UW-j-T2TzIg>`__ fornisce informazioni sulla configurazione di build di Toaster.

source: *Configure and Run Builds:* You can use the Toaster web interface to configure and start your builds. Builds started using the Toaster web interface are organized into projects. When you create a project, you are asked to select a release, or version of the build system you want to use for the project builds. As shipped, Toaster supports Yocto Project releases 1.8 and beyond. With the Toaster web interface, you can:
it_it: *Configurazione ed Esecuzione delle Build:* È possibile utilizzare l'interfaccia web di Toaster per configurare e avviare le build. Le build avviate tramite l'interfaccia web di Toaster sono organizzate in progetti. Quando si crea un progetto, viene richiesto di selezionare una release, ovvero una versione del sistema di build, da utilizzare per le build del progetto. Toaster supporta le release di Yocto Project dalla 1.8 in poi. Tramite l'interfaccia web di Toaster, è possibile:

source: *Create Your Own BSP Layer Using the bitbake-layers Script:* Layers are ideal for isolating and storing work for a given piece of hardware. A layer is really just a location or area in which you place the recipes and configurations for your BSP. In fact, a BSP is, in itself, a special type of layer. The simplest way to create a new BSP layer that is compliant with the Yocto Project is to use the ``bitbake-layers`` script. For information about that script, see the ":ref:`bsp-manual/bsp:creating a new bsp layer using the \`\`bitbake-layers\`\` script`" section.
it_it: *Creare il Proprio Layer BSP Utilizzando lo Script bitbake-layers:* I layer sono ideali per isolare e archiviare il lavoro per un determinato componente hardware. Un layer è essenzialmente una posizione o un'area in cui si inseriscono le ricette e le configurazioni per il BSP. Di fatto, un BSP è, di per sé, un tipo speciale di layer. Il modo più semplice per creare un nuovo layer BSP conforme a Yocto Project è utilizzare lo script ``bitbake-layers``. Per informazioni su quello script, consultare la sezione ":ref:`bsp-manual/bsp:creating a new bsp layer using the \`\`bitbake-layers\`\` script`".

source: *Create a General Layer:* Use the ``bitbake-layers`` script with the ``create-layer`` subcommand to create a new general layer. For instructions on how to create a general layer using the ``bitbake-layers`` script, see the ":ref:`dev-manual/layers:Creating Your Own Layer`" section in the Yocto Project Development Tasks Manual.
it_it: *Creazione di un Layer Generico:* Utilizzare lo script ``bitbake-layers`` con il sottocomando ``create-layer`` per creare un nuovo layer generico. Per istruzioni su come creare un layer generico utilizzando lo script ``bitbake-layers``, consultare la sezione ":ref:`dev-manual/layers:Creating Your Own Layer`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: *Create a Kernel Recipe:* Create a kernel recipe in ``recipes-kernel/linux`` by either using a kernel append file or a new custom kernel recipe file (e.g. ``linux-yocto_6.12.bb``). The BSP layers mentioned in the previous step also contain different kernel examples. See the ":ref:`kernel-dev/common:modifying an existing recipe`" section in the Yocto Project Linux Kernel Development Manual for information on how to create a custom kernel.
it_it: *Creazione di una Ricetta del Kernel:* Creare una ricetta del kernel in ``recipes-kernel/linux`` utilizzando un file di aggiunta del kernel o un nuovo file di ricetta del kernel personalizzato (ad esempio ``linux-yocto_6.12.bb``). Anche i layer BSP menzionati nel passaggio precedente contengono diversi esempi di kernel. Consultare la sezione ":ref:`kernel-dev/common:modifying an existing recipe`" nel Manuale di Sviluppo del Kernel Linux di Yocto Project per informazioni su come creare un kernel personalizzato.

source: *Create a Layer Configuration File:* Every layer needs a layer configuration file. This configuration file establishes locations for the layer's recipes, priorities for the layer, and so forth. You can find examples of ``layer.conf`` files in the Yocto Project :yocto_git:`Source Repositories <>`. To get examples of what you need in your configuration file, locate a layer (e.g. "meta-ti") and examine the :yocto_git:`layer.conf </meta-ti/tree/meta-ti-bsp/conf/layer.conf>` file.
it_it: *Creazione di un File di Configurazione del Layer:* Ogni layer necessita di un file di configurazione. Questo file di configurazione definisce la posizione delle ricette del layer, le priorità del layer e così via. È possibile trovare esempi di file ``layer.conf`` nei :yocto_git:`Source Repositories <>` di Yocto Project. Per ottenere esempi di ciò che è necessario nel file di configurazione, individuare un layer (ad esempio "meta-ti") ed esaminare il file :yocto_git:`layer.conf </meta-ti/tree/meta-ti-bsp/conf/layer.conf>`.

source: *Create a Machine Configuration File:* Create a ``conf/machine/bsp_root_name.conf`` file. See :yocto_git:`meta-yocto-bsp/conf/machine </meta-yocto/tree/meta-yocto-bsp/conf/machine>` for sample ``bsp_root_name.conf`` files. There are other samples such as :yocto_git:`meta-ti </meta-ti/tree/meta-ti-bsp/conf/machine>` and :yocto_git:`meta-freescale </meta-freescale/tree/conf/machine>` from other vendors that have more specific machine and tuning examples.
it_it: *Creare un File di Configurazione della Macchina:* Creare un file ``conf/machine/bsp_root_name.conf``. Consultare :yocto_git:`meta-yocto-bsp/conf/machine </meta-yocto/tree/meta-yocto-bsp/conf/machine>` per esempi di file ``bsp_root_name.conf``. Esistono altri esempi, come :yocto_git:`meta-ti </meta-ti/tree/meta-ti-bsp/conf/machine>` e :yocto_git:`meta-freescale </meta-freescale/tree/conf/machine>` di altri fornitori, che offrono esempi di configurazione e ottimizzazione più specifici per determinate macchine.

source: *Describe the Changes in your Branch:* If you have more than one commit in your branch, it's recommended to provide a cover letter describing the series of patches you are about to send.
it_it: *Descrivere le Modifiche nel Proprio Branch:* Se il branch contiene più di un commit, si consiglia di allegare una lettera di presentazione che descriva la serie di patch inviata.

source: *Detailed Public Information Not Specific to the Yocto Project:* For example, exhaustive information on how to use the Source Control Manager Git is better covered with Internet searches and official Git Documentation than through the Yocto Project documentation.
it_it: *Informazioni pubbliche dettagliate non specifiche di Yocto Project:* Ad esempio, informazioni esaustive su come utilizzare il Source Control Manager Git sono reperibili più facilmente tramite ricerche su Internet e la documentazione ufficiale di Git, piuttosto che attraverso la documentazione di Yocto Project.

source: *Determine Who to Notify:* Determine the maintainer or the mailing list that you need to notify for the change.
it_it: *Determinare a Chi Notificare:* Determinare il manutentore o la mailing list a cui notificare la modifica.

source: *Determine the BSP Layer You Want:* The Yocto Project supports many BSPs, which are maintained in their own layers or in layers designed to contain several BSPs. The :oe_layerindex:`Layer Index <>` can help finding BSP layers to use.
it_it: *Individuazione del layer BSP Desiderato:* Yocto Project supporta numerosi BSP, gestiti in layer dedicati o in layer progettati per contenerne diversi. Il :oe_layerindex:`Layer Index <>` può essere utile per trovare i layer BSP da utilizzare.

source: *Distribution Policy:* Controlled by the :term:`DISTRO` variable.
it_it: *Policy di Distribuzione:* Controllata dalla variabile :term:`DISTRO`.

source: *Download Directory:* Controlled by the :term:`DL_DIR` variable.
it_it: *Directory di Download:* Controllata dalla variabile :term:`DL_DIR`.

source: *Establish the meta-intel Repository on Your System:* Having local copies of these supported BSP layers on your system gives you access to layers you might be able to leverage when creating your BSP. For information on how to get these files, see the ":ref:`bsp-manual/bsp:preparing your build host to work with bsp layers`" section.
it_it: *Creare il Repository meta-intel sul Proprio Sistema:* Avere copie locali di questi layer BSP supportati sul proprio sistema dà accesso a layer utilizzabili durante la creazione del BSP. Per informazioni su come ottenere questi file, consultare la sezione ":ref:`bsp-manual/bsp:preparing your build host to work with bsp layers`".

source: *Extensible Software Development Kit (eSDK):* A custom SDK for application developers. This eSDK allows developers to incorporate their library and programming changes back into the image to make their code available to other application developers. For information on the eSDK, see the :doc:`/sdk-manual/index` manual.
it_it: *Extensible Software Development Kit (eSDK):* Un SDK personalizzato per gli sviluppatori di applicazioni. Questo eSDK consente agli sviluppatori di integrare le proprie librerie e modifiche di programmazione nell'immagine, rendendo il codice disponibile ad altri sviluppatori di applicazioni. Per informazioni sull'eSDK, consultare il manuale :doc:`/sdk-manual/index`.

source: *Extensible Software Development Kit (eSDK):* The eSDK provides a cross-development toolchain and libraries tailored to the contents of a specific image. The eSDK makes it easy to add new applications and libraries to an image, modify the source for an existing component, test changes on the target hardware, and integrate into the rest of the OpenEmbedded build system. The eSDK gives you a toolchain experience supplemented with the powerful set of ``devtool`` commands tailored for the Yocto Project environment.
it_it: *Extensible Software Development Kit (eSDK):* L'eSDK fornisce una toolchain di cross-sviluppo e librerie specifiche per il contenuto di una determinata immagine. L'eSDK semplifica l'aggiunta di nuove applicazioni e librerie a un'immagine, la modifica del codice sorgente di un componente esistente, il test delle modifiche sull'hardware target e l'integrazione con il resto del sistema di build OpenEmbedded. L'eSDK offre un'esperienza di toolchain arricchita dal potente set di comandi ``devtool`` ottimizzati per l'ambiente Yocto Project.

source: *Extra Image Packages:* Controlled by the :term:`EXTRA_IMAGE_FEATURES` variable.
it_it: *Pacchetti Extra dell'Immagine:* Controllati dalla variabile :term:`EXTRA_IMAGE_FEATURES`.

source: *File System Layout:* When possible, use the same directory names in your BSP layer as listed in the ``recipes.txt`` file, which is found in :oe_git:`meta </openembedded-core/tree/meta>` directory of :term:`OpenEmbedded-Core (OE-Core)`.
it_it: *Struttura del File System:* Quando possibile, utilizzare gli stessi nomi di directory nel layer BSP elencati nel file ``recipes.txt``, che si trova nella directory :oe_git:`meta </openembedded-core/tree/meta>` di :term:`OpenEmbedded-Core (OE-Core)`.

source: *Find the Mailing List to Use:* See the ":ref:`contributor-guide/submit-changes:finding a suitable mailing list`" section above.
it_it: *Trovare la Mailing List da Utilizzare:* Consultare la sezione ":ref:`contributor-guide/submit-changes:finding a suitable mailing list`" sopra.

source: *Flexibility:* Corporations use the Yocto Project many different ways. One example is to create an internal Linux distribution as a code base the corporation can use across multiple product groups. Through customization and layering, a project group can leverage the base Linux distribution to create a distribution that works for their product needs.
it_it: *Flessibilità:* Le aziende utilizzano Yocto Project in molti modi diversi. Un esempio è la creazione di una distribuzione Linux interna come base di codice che l'azienda può utilizzare in più gruppi di prodotto. Attraverso la personalizzazione e il layering, un gruppo di progetto può sfruttare la distribuzione Linux di base per creare una distribuzione adatta alle proprie esigenze di prodotto.

source: *Generate Patches for your Branch:* The ``git format-patch`` command will generate patch files for each of the commits in your branch. You need to pass the reference branch your branch starts from.
it_it: *Generare le Patch per il Branch:* Il comando ``git format-patch`` genererà i file patch per ogni commit del branch. È necessario specificare il branch di riferimento da cui parte il branch.

source: *Get a Pre-Built Version of the BSP:* You can get this type of BSP by selecting the "DOWNLOADS" item from the "SOFTWARE" tab on the :yocto_home:`Yocto Project website <>`. You can download BSP tarballs that contain proprietary components after agreeing to the licensing requirements of each of the individually encumbered packages as part of the download process. Obtaining the BSP this way allows you to access an encumbered image immediately after agreeing to the click-through license agreements presented by the website. If you want to build the image yourself using the recipes contained within the BSP tarball, you will still need to create an appropriate :term:`LICENSE_FLAGS_ACCEPTED` to match the encumbered recipes in the BSP.
it_it: *Ottenere una versione precompilata del BSP:* È possibile ottenere questo tipo di BSP selezionando la voce "DOWNLOADS" dalla scheda "SOFTWARE" sul :yocto_home:`Sito Web di Yocto Project <>`. È possibile scaricare i file tarball BSP contenenti componenti proprietari dopo aver accettato i termini di licenza di ciascun pacchetto, inclusi quelli con licenza, durante il processo di download. Ottenere il BSP in questo modo consente di accedere immediatamente a un'immagine con licenza dopo aver accettato i termini di licenza presentati dal sito web. Per compilare l'immagine autonomamente utilizzando le ricette contenute nel file tarball BSP, sarà comunque necessario creare un :term:`LICENSE_FLAGS_ACCEPTED` appropriato per corrispondere alle ricette con licenza presenti nel BSP.

source: *Hob:* Hob, which is now deprecated and is no longer available since the 2.1 release of the Yocto Project provided a rudimentary, GUI-based interface to the Yocto Project. Toaster has fully replaced Hob.
it_it: *Hob:* Hob, ora deprecato e non più disponibile dalla versione 2.1 di Yocto Project, forniva un'interfaccia grafica rudimentale per Yocto Project. Toaster ha completamente sostituito Hob.
